Revit 2027 API
AddInIdAttribute.Value Property
AddInId guid value.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ValueType Value { get; }
Public ReadOnly Property Value As ValueType
	Get
public:
property ValueType^ Value {
	ValueType^ get ();
}
member Value : ValueType with get
Property Value
ValueType
See Also
Reference
AddInIdAttribute Class
Autodesk.Revit.DB.Macros Namespace